УТ_для_edt/src/InformationRegisters/CRM_НастройкиСвязиОбращенийСИнтересами/CRM_НастройкиСвязиОбращенийСИнтересами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиСвязиОбращенийСИнтересами</name>
  <resources>
    <name>СвязыватьОбращенияСИнтересами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимСвязиЕслиИнтересовБолееОдного</name>
    <type>
      <types>EnumRef.CRM_РежимыСвязиОбращенияСИнтересами</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникОбращения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>String</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_РежимыСвязиОбращенияСИнтересами/CRM_РежимыСвязиОбращенияСИнтересами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_РежимыСвязиОбращенияСИнтересами</name>
  <enumValues>
    <name>НеСвязывать</name>
  </enumValues>
  <enumValues>
    <name>СвязыватьСоВсеми</name>
  </enumValues>
  <enumValues>
    <name>СвязыватьСПоследним</name>
  </enumValues>
  <enumValues>
    <name>СвязыватьПоНомеру</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/CRM_НастройкиСвязиОбращенийСИнтересами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройки свзяи обращений с интересами при переходе.
//
// Параметры:
//  Параметры - Структура - содержит параметры
//
Процедура ЗаполнитьНастройкиСвязиОбращенийСИнтересамиПриПереходе(Параметры) Экспорт

	
КонецПроцедуры

// Возвращает признак того, является ли ссылка источником обращения
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - Проверяемая ссылка.
//
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция ЭтоИсточникОбращения(Ссылка) Экспорт
	Возврат Метаданные.РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.Измерения.ИсточникОбращения.Тип.СодержитТип(ТипЗнч(Ссылка));
КонецФункции

// Выполняет дополнительные действия при создании формы источника.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма источника.
//  ИсточникОбращения - см. РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.ЭтоИсточникОбращения.
//  Группа - Строка - Имя элемента группы.
//
Процедура ФормаИсточникаПриСозданииНаСервере(Форма, ИсточникОбращения = Неопределено, Группа = "") Экспорт

	Если ИсточникОбращения = Неопределено Тогда
		ИсточникОбращения = Форма.Объект.Ссылка;
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	Если ТипЗнч(ИсточникОбращения) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ЗаголовокФлага = НСтр("ru='Автоматически связывать входящие письма с активными интересами';en='Automatically associate incoming emails with active leads'")
	ИначеЕсли ТипЗнч(ИсточникОбращения) = Тип("СправочникСсылка.CRM_УчетныеЗаписиМессенджеров") Тогда
		ЗаголовокФлага = НСтр("ru='Автоматически связывать входящие сообщения с активными интересами';en='Automatically associate incoming messages with active leads'")
	ИначеЕсли ИсточникОбращения = "Телефония" Тогда
		ЗаголовокФлага = НСтр("ru='Автоматически связывать входящие звонки с активными интересами';en='Automatically associate incoming calls with active leads'")
	Иначе
		ЗаголовокФлага = НСтр("ru='Автоматически связывать с активными интересами';en='Automatically associate with active leads'")
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НастройкиСвязиОбращенийСИнтересами_Связывать",
		Новый ОписаниеТипов("Булево"),, ЗаголовокФлага, Истина));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("НастройкиСвязиОбращенийСИнтересами_РежимСвязи",
		Новый ОписаниеТипов("ПеречислениеСсылка.CRM_РежимыСвязиОбращенияСИнтересами"),, НСтр("ru='Если активных интересов более одного, тогда';en='If active leads more than one, than'"), Истина));
			
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	Настройки = НастройкиСвязиОбращенийСИнтересами(ИсточникОбращения);
	Форма["НастройкиСвязиОбращенийСИнтересами_Связывать"] = Настройки.Связывать;
	Форма["НастройкиСвязиОбращенийСИнтересами_РежимСвязи"] = Настройки.РежимСвязи;
	
	Если Группа <> "" Тогда
		ГруппаРасположения = Форма.Элементы.Найти(Группа);
	Иначе
		ГруппаРасположения = Неопределено;
	КонецЕсли;
	
	Расположение = Форма.Элементы.Найти("НастройкиСвязиОбращенийСИнтересами");
	Если Расположение = Неопределено Тогда
		Расположение = Форма.Элементы.Добавить("НастройкиСвязиОбращенийСИнтересами", Тип("ГруппаФормы"), ГруппаРасположения);
		Расположение.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Расположение.ОтображатьЗаголовок = Ложь;
		Расположение.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	ЭлементСвязывать = Форма.Элементы.Добавить("НастройкиСвязиОбращенийСИнтересами_Связывать", Тип("ПолеФормы"), Расположение);
	ЭлементСвязывать.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементСвязывать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементСвязывать.ПутьКДанным = "НастройкиСвязиОбращенийСИнтересами_Связывать";
	
	ЭлементРежимСвязи = Форма.Элементы.Добавить("НастройкиСвязиОбращенийСИнтересами_РежимСвязи", Тип("ПолеФормы"), Расположение);
	ЭлементРежимСвязи.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРежимСвязи.ВысотаЗаголовка = 2;
	ЭлементРежимСвязи.ПутьКДанным = "НастройкиСвязиОбращенийСИнтересами_РежимСвязи";
	
	УО = Форма.УсловноеОформление.Элементы;
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ПолеУсловия = ЭлементУО.Поля.Элементы.Добавить();
	ПолеУсловия.Поле = Новый ПолеКомпоновкиДанных("НастройкиСвязиОбращенийСИнтересами_РежимСвязи");
	ГруппаУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаУсловия.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементУсловия = ГруппаУсловия.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиСвязиОбращенийСИнтересами_Связывать");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ГруппаУсловия.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиСвязиОбращенийСИнтересами_РежимСвязи");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
КонецПроцедуры

// Выполняет дополнительные действия при записи формы источника.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма источника.
//  ИсточникОбращения - см. РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.ЭтоИсточникОбращения.
//
Процедура ФормаИсточникаПриЗаписи(Форма, ИсточникОбращения = Неопределено) Экспорт

	Если ИсточникОбращения = Неопределено Тогда
		ИсточникОбращения = Форма.Объект.Ссылка;
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИсточникОбращения = ИсточникОбращения;
	
	Если Форма.Элементы.Найти("НастройкиСвязиОбращенийСИнтересами_Связывать") <> Неопределено Тогда
		МенеджерЗаписи.СвязыватьОбращенияСИнтересами = Форма["НастройкиСвязиОбращенийСИнтересами_Связывать"];
	КонецЕсли;

	Если Форма.Элементы.Найти("НастройкиСвязиОбращенийСИнтересами_Связывать") <> Неопределено Тогда
		МенеджерЗаписи.РежимСвязиЕслиИнтересовБолееОдного = Форма["НастройкиСвязиОбращенийСИнтересами_РежимСвязи"];
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Выполняет настройку связи обращений с интересами.
//
// Параметры:
//  Источник - см. РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.ЭтоИсточникОбращения.
//
// Возвращаемое значение:
//  Структура - содержит настройки
//
Функция НастройкиСвязиОбращенийСИнтересами(Источник) Экспорт
	
	Настройки = Новый Структура("Связывать, РежимСвязи", Ложь, Перечисления.CRM_РежимыСвязиОбращенияСИнтересами.НеСвязывать);
		
	Если ЭтоИсточникОбращения(Источник) Тогда
		ИсточникТемп = Источник;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") Тогда
		ИсточникТемп = Источник.УчетнаяЗапись;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок") Тогда
		ИсточникТемп = "Телефония";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_СообщениеМессенджера") Тогда
		// +Рарус alexpr
		//ИсточникТемп = Источник.УчетнаяЗапись;
		ИсточникТемп = Источник.Диалог.УчетнаяЗапись;
		// -Рарус alexpr
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Заявка") Тогда
		ИсточникТемп = Источник.ИсточникПолучения;
	КонецЕсли;
	
	Выборка = Выбрать(Новый Структура("ИсточникОбращения", Источник));
	
	Если Выборка.Следующий() Тогда
		Настройки.Связывать = Выборка.СвязыватьОбращенияСИнтересами;
		Если ЗначениеЗаполнено(Выборка.РежимСвязиЕслиИнтересовБолееОдного) Тогда
			Настройки.РежимСвязи = Выборка.РежимСвязиЕслиИнтересовБолееОдного;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
